org/quantization.org
#+SETUPFILE:./hugo_setup.org
#+TITLE: Quantization

- tags :: [[file:model_compression.org][Model Compression]], [[file:machine_learning.org][Machine Learning]]

Quantization refers to techniques for performing computations and
storing tensors at lower bitwidths than floating point precision.

Quantization is useful in reducing model size, and memory
requirements.

Pytorch supports two libraries for quantization:

- [[https://github.com/pytorch/FBGEMM][FBGEMM]]
- [[https://github.com/pytorch/QNNPACK][QNNPACK]]

* Questions

- Can we quantize [[file:spiking_neural_networks.org][§spiking_neural_networks]]? They already do binary
  precision computation, what about the weights?

